Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-leela-suthar]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-leela_suthar]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=02337d1c-dcef-48a5-aacc-ab5402dea502]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=leelasuthar]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_9459e78d-e66f-424d-876b-7b5427175184.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-leela_suthar:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello_kitty_leela_suthar]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=leelasuthar]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=leelasuthar]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-leelasuthar]
module.appcd_5081653b-549b-4422-998c-2a5dd5d489e9.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-leela_suthar:aws_s3-hello-kitty-policy]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=leelasuthar]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello_kitty_leela_suthar]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_5081653b-549b-4422-998c-2a5dd5d489e9.aws_iam_role_policy.this will be updated in-place
  ~ resource "aws_iam_role_policy" "this" {
        id          = "hello-kitty-role-leela_suthar:aws_s3-hello-kitty-policy"
        name        = "aws_s3-hello-kitty-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:Encrypt",
                          - "kms:GenerateDataKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:us-west-2:222634395437:key/02337d1c-dcef-48a5-aacc-ab5402dea502",
                        ]
                      - Sid      = "AllowKmsAccess"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetObjectVersion",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::leelasuthar",
                          - "arn:aws:s3:::leelasuthar/*",
                        ]
                      - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] must be replaced
-/+ resource "aws_kms_alias" "a" {
      ~ arn            = "arn:aws:kms:us-west-2:222634395437:alias/s3-leelasuthar" -> (known after apply)
      ~ id             = "alias/s3-leelasuthar" -> (known after apply)
      ~ name           = "alias/s3-leelasuthar" -> "alias/s3-leela_suthar" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:us-west-2:222634395437:key/02337d1c-dcef-48a5-aacc-ab5402dea502" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::leelasuthar" -> (known after apply)
      ~ bucket                      = "leelasuthar" -> "leela_suthar" # forces replacement
      ~ bucket_domain_name          = "leelasuthar.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "leelasuthar.s3.us-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
      ~ id                          = "leelasuthar" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-west-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "appstack"  = "hello_kitty_photos"
            "component" = "hello-kitty"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "142ffdd1f87132a598f0ca276babbb31f1f8672261731ae3635f0b84be07a341" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "02337d1c-dcef-48a5-aacc-ab5402dea502" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "leelasuthar" -> (known after apply) # forces replacement
      ~ id                      = "leelasuthar" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket                = "leelasuthar" -> (known after apply) # forces replacement
      ~ id                    = "leelasuthar" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "02337d1c-dcef-48a5-aacc-ab5402dea502" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "02337d1c-dcef-48a5-aacc-ab5402dea502"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket                = "leelasuthar" -> (known after apply) # forces replacement
      ~ id                    = "leelasuthar" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-leela-suthar" -> (known after apply)
      ~ id                = "/aws/lambda/hello-kitty-function-leela-suthar" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/hello-kitty-function-leela-suthar" -> "/aws/lambda/hello-kitty-function-leela_suthar" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "appstack"  = "hello_kitty_photos"
            "component" = "hello-kitty"
        }
        # (4 unchanged attributes hidden)
    }

  # module.appcd_9459e78d-e66f-424d-876b-7b5427175184.aws_iam_role_policy.this will be updated in-place
  ~ resource "aws_iam_role_policy" "this" {
        id          = "hello-kitty-role-leela_suthar:Writer"
        name        = "Writer"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-leela-suthar",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-leela-suthar:*",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

Changes to Outputs:
  ~ aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_leela_suthar_arn  = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-leela-suthar" -> (known after apply)
  ~ aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_leela_suthar_name = "/aws/lambda/hello-kitty-function-leela-suthar" -> "/aws/lambda/hello-kitty-function-leela_suthar"
  + aws_s3_leela_suthar_arn                                                    = (known after apply)
  + aws_s3_leela_suthar_bucket_name                                            = (known after apply)
  + aws_s3_leela_suthar_kms_arn                                                = "arn:aws:kms:us-west-2:222634395437:key/02337d1c-dcef-48a5-aacc-ab5402dea502"
  - aws_s3_leelasuthar_arn                                                     = "arn:aws:s3:::leelasuthar" -> null
  - aws_s3_leelasuthar_bucket_name                                             = "leelasuthar" -> null
  - aws_s3_leelasuthar_kms_arn                                                 = "arn:aws:kms:us-west-2:222634395437:key/02337d1c-dcef-48a5-aacc-ab5402dea502" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```